examples/flows/compiled/if_mutations_in_branches/flow.mmd
flowchart TD
    %% Flow: if_mutations_in_branches_flow

    end_if_mutations_in_branches_flow([end_if_mutations_in_branches_flow])
    handler_finalize[handler_finalize]
    handler_setup[handler_setup]
    handler_type_a[handler_type_a]
    handler_type_b[handler_type_b]
    router_if_mutations_in_branches_flow_line_14_if_3{{router_if_mutations_in_branches_flow_line_14_if_3}}
    router_if_mutations_in_branches_flow_line_15_seq_1{{router_if_mutations_in_branches_flow_line_15_seq_1}}
    router_if_mutations_in_branches_flow_line_20_seq_2{{router_if_mutations_in_branches_flow_line_20_seq_2}}
    start_if_mutations_in_branches_flow([start_if_mutations_in_branches_flow])

    start_if_mutations_in_branches_flow --> handler_setup
    handler_setup --> router_if_mutations_in_branches_flow_line_14_if_3
    router_if_mutations_in_branches_flow_line_15_seq_1 --> handler_type_a
    router_if_mutations_in_branches_flow_line_14_if_3 -->|p['type'] == 'A'| router_if_mutations_in_branches_flow_line_15_seq_1
    router_if_mutations_in_branches_flow_line_15_seq_1 --> handler_finalize
    router_if_mutations_in_branches_flow_line_14_if_3 -->|not (p['type'] == 'A')| handler_type_b
    handler_type_b --> router_if_mutations_in_branches_flow_line_20_seq_2
    router_if_mutations_in_branches_flow_line_20_seq_2 --> handler_finalize
    handler_finalize --> end_if_mutations_in_branches_flow
